function loopsDemo() {

    let a = 5;
    
     //Преинкрементация - преди ++a;
     //Постинкрементация - след a++;
    
    console.log(a);
    console.log(++a); // Добавя стойността веднага.
    console.log(a++); // Добавената стойност е на следващия ред.
    console.log(`Last value of a:${a}`);
}
loopsDemo()

//a = a + 10; // result 15;
//a+=10;  // result 15;
//a+=1
//С инкрементациа можем само да събираме или изваждаме само 1-ца като стойност.
//Запомнете "Не можем да делим или да умножаваме".